import re
import json

print('Declare input file without file extension.')
input_text = input('Type in input file : ')
input_text = input_text + '.txt'
search_string = ''
fileo = 'φῐλῶ 	φῐλεῖς 	φῐλεῖ 	φῐλεῖτον 	φῐλεῖτον 	φῐλοῦμεν 	φῐλεῖτε 	φῐλοῦσῐ(ν) φῐλῶ 	φῐλῇς 	φῐλῇ 	φῐλῆτον 	φῐλῆτον 	φῐλῶμεν 	φῐλῆτε 	φῐλῶσῐ(ν) φῐλοίην φῐλοῖμῐ 	φῐλοίης φῐλοῖς 	φῐλοίη φῐλοῖ 	φῐλοῖτον φῐλοίητον 	φῐλοίτην φῐλοιήτην 	φῐλοῖμεν φῐλοίημεν 	φῐλοῖτε φῐλοίητε 	φῐλοῖεν φῐλοίησᾰν φῐ́λει 	φῐλείτω 	φῐλεῖτον 	φῐλείτων 	  	φῐλεῖτε 	φῐλούντων  	φῐλοῦμαι 	φῐλεῖ φῐλῇ 	φῐλεῖται 	φῐλεῖσθον 	φῐλεῖσθον 	φῐλούμεθᾰ 	φῐλεῖσθε 	φῐλοῦνται	φῐλῶμαι 	φῐλῇ 	φῐλῆται 	φῐλῆσθον 	φῐλῆσθον 	φῐλώμεθᾰ 	φῐλῆσθε 	φῐλῶνται 	φῐλοίμην 	φῐλοῖο 	φῐλοῖτο 	φῐλοῖσθον 	φῐλοίσθην 	φῐλοίμεθᾰ 	φῐλοῖσθε 	φῐλοῖντο 	  	φῐλοῦ 	φῐλείσθω 	φῐλεῖσθον 	φῐλείσθων 	  	φῐλεῖσθε 	φῐλείσθων 	φῐλεῖν 	φῐλεῖσθαι φῐλῶν	φῐλούμενος φῐλοῦσᾰ 	φῐλουμένη φῐλοῦν 	φῐλούμενον ἐφῐ́λουν 	ἐφῐ́λεις 	ἐφῐ́λει 	ἐφῐλεῖτον 	ἐφῐλείτην 	ἐφῐλοῦμεν 	ἐφῐλεῖτε 	ἐφῐ́λουν ἐφῐλούμην 	ἐφῐλοῦ 	ἐφῐλεῖτο 	ἐφῐλεῖσθον 	ἐφῐλείσθην 	ἐφῐλούμεθᾰ 	ἐφῐλεῖσθε 	ἐφῐλοῦντο φῐλήσω 	φῐλήσεις 	φῐλήσει 	φῐλήσετον 	φῐλήσετον 	φῐλήσομεν 	φῐλήσετε 	φῐλήσουσῐ(ν) φῐλήσοιμῐ 	φῐλήσοις 	φῐλήσοι 	φῐλήσοιτον 	φῐλησοίτην 	φῐλήσοιμεν 	φῐλήσοιτε 	φῐλήσοιεν φῐλήσομαι 	φῐλήσῃ φῐλήσει 	φῐλήσεται 	φῐλήσεσθον 	φῐλήσεσθον 	φῐλησόμεθᾰ 	φῐλήσεσθε 	φῐλήσονται φῐλησοίμην 	φῐλήσοιο 	φῐλήσοιτο 	φῐλήσοισθον 	φῐλησοίσθην 	φῐλησοίμεθᾰ 	φῐλήσοισθε 	φῐλήσοιντο φῐληθήσομαι 	φῐληθήσῃ 	φῐληθήσεται 	φῐληθήσεσθον 	φῐληθήσεσθον 	φῐληθησόμεθᾰ 	φῐληθήσεσθε 	φῐληθήσονται φῐληθησοίμην 	φῐληθήσοιο 	φῐληθήσοιτο 	φῐληθήσοισθον 	φῐληθησοίσθην 	φῐληθησοίμεθᾰ 	φῐληθήσοισθε 	φῐληθήσοιντο φῐλήσειν 	φῐλήσεσθαι 	φῐληθήσεσθαι φῐλήσων 	φῐλησόμενος 	φῐληθησόμενος φῐλήσουσᾰ 	φῐλησομένη 	φῐληθησομένη φῐλῆσον 	φῐλησόμενον 	φῐληθησόμενον ἐφῐ́λησᾰ 	ἐφῐ́λησᾰς 	ἐφῐ́λησε(ν) 	ἐφῐλήσᾰτον 	ἐφῐλησᾰ́την 	ἐφῐλήσᾰμεν 	ἐφῐλήσᾰτε 	ἐφῐ́λησᾰν φῐλήσω 	φῐλήσῃς 	φῐλήσῃ 	φῐλήσητον 	φῐλήσητον 	φῐλήσωμεν 	φῐλήσητε 	φῐλήσωσῐ(ν) φῐλήσαιμῐ 	φῐλήσειᾰς φῐλήσαις 	φῐλήσειε(ν) φῐλήσαι 	φῐλήσαιτον 	φῐλησαίτην 	φῐλήσαιμεν 	φῐλήσαιτε 	φῐλήσειᾰν φῐλήσαιεν φῐ́λησον 	φῐλησᾰ́τω 	φῐλήσᾰτον 	φῐλησᾰ́των 	  	φῐλήσᾰτε 	φῐλησᾰ́ντων ἐφῐλησᾰ́μην 	ἐφῐλήσω 	ἐφῐλήσᾰτο 	ἐφῐλήσᾰσθον 	ἐφῐλησᾰ́σθην 	ἐφῐλησᾰ́μεθᾰ 	ἐφῐλήσᾰσθε 	ἐφῐλήσᾰντο φῐλήσωμαι 	φῐλήσῃ 	φῐλήσηται 	φῐλήσησθον 	φῐλήσησθον 	φῐλησώμεθᾰ 	φῐλήσησθε 	φῐλήσωνται φῐλησαίμην 	φῐλήσαιο 	φῐλήσαιτο 	φῐλήσαισθον 	φῐλησαίσθην 	φῐλησαίμεθᾰ 	φῐλήσαισθε 	φῐλήσαιντο φῐ́λησαι 	φῐλησᾰ́σθω 	φῐλήσᾰσθον 	φῐλησᾰ́σθων 	  	φῐλήσᾰσθε 	φῐλησᾰ́σθων ἐφῐλήθην 	ἐφῐλήθης 	ἐφῐλήθη 	ἐφῐλήθητον 	ἐφῐληθήτην 	ἐφῐλήθημεν 	ἐφῐλήθητε 	ἐφῐλήθησᾰν φῐληθῶ 	φῐληθῇς 	φῐληθῇ 	φῐληθῆτον 	φῐληθῆτον 	φῐληθῶμεν 	φῐληθῆτε 	φῐληθῶσῐ(ν)  φῐληθείην 	φῐληθείης 	φῐληθείη 	φῐληθεῖτον φῐληθείητον 	φῐληθείτην φῐληθειήτην 	φῐληθεῖμεν φῐληθείημεν 	φῐληθεῖτε φῐληθείητε 	φῐληθεῖεν φῐληθείησᾰν φῐλήθητῐ 	φῐληθήτω 	φῐλήθητον 	φῐληθήτων 	  	φῐλήθητε 	φῐληθέντων φῐλῆσαι 	φῐλήσᾰσθαι 	φῐληθῆναι φῐλήσᾱς 	φῐλησᾰ́μενος 	φῐληθείς φῐλήσᾱσᾰ 	φῐλησᾰμένη 	φῐληθεῖσᾰ φῐλῆσᾰν 	φῐλησᾰ́μενον 	φῐληθέν πεφῐληκέναι 	πεφῐλῆσθαι πεφῐληκώς 	πεφῐλημένος πεφῐληκυῖᾰ 	πεφῐλημένη πεφῐληκός 	πεφῐλημένον'
# https://en.wiktionary.org/wiki/%CF%86%CE%B9%CE%BB%CE%AD%CF%89
# https://en.wiktionary.org/wiki/%E1%BC%90%CF%81%CE%AC%CF%89
search_string = search_string + fileo
terms = []

with open(input_text,'r') as file:
    text = file.read()
    text = json.loads(text)

def push_terms(string, terms):
    terms = string.strip().split()
    return terms
# TO DO push terms from file
terms = push_terms(search_string, terms)

def getDistributionThreeLevel(text, terms):
  distribution = []
  result = []
  for index, books in enumerate(text):
    distribution.append([index, 0, 0])
    for paragraph in books:
      for content in paragraph:
        for term in terms:
          distribution[index][2] = len(content)
          result = re.findall(fr'\b{term}\b', content)
          distribution[index][1] = distribution[index][1] + len(result)
  return distribution

def getTotalOcurrences(distribution):
  sum = 0
  for element in distribution:
    sum += element[2]
  return sum

distribution = getDistributionThreeLevel(text,terms)
sum = getTotalOcurrences(distribution)

print(distribution)

#with open('data.json', 'w') as file:
#  data = {"total": sum, "distribution": distribution}
#  output = json.dumps(data)
#  file.write(output)

# with open('distribution.csv', 'a') as file:
#    print('hello')